In [15]:
import pandas as pd
from sqlalchemy import create_engine
import codecs

In [16]:
sets__2020_csv = "sets.csv"
sets_2020_db = pd.read_csv(sets__2020_csv)

sets_2020_db.head()

  set_num                        name  year  theme_id  num_parts
0   001-1                       Gears  1965         1         43
1  0011-2           Town Mini-Figures  1978        84         12
2  0011-3  Castle 2 for 1 Bonus Offer  1987       199          0
3  0012-1          Space Mini-Figures  1979       143         12
4  0013-1          Space Mini-Figures  1979       143         12

In [17]:
sets_clean_20_db = sets_2020_db[['theme_id', 'name', 'year']].copy()
sets_clean_20_db.rename(columns={"theme_id" :"id"},inplace=True)
sets_clean_20_db.head()

    id                        name  year
0    1                       Gears  1965
1   84           Town Mini-Figures  1978
2  199  Castle 2 for 1 Bonus Offer  1987
3  143          Space Mini-Figures  1979
4  143          Space Mini-Figures  1979

In [18]:
thems_2020_csv = "themes.csv"
thems_2020_db =pd.read_csv(thems_2020_csv)
thems_2020_db.head()

   id            name  parent_id
0   1         Technic        NaN
1   2  Arctic Technic        1.0
2   3     Competition        1.0
3   4  Expert Builder        1.0
4   5           Model        1.0

In [19]:

join_2020=sets_clean_20_db.merge(thems_2020_db, on="id")
join_2020.head()

   id                          name_x  year   name_y  parent_id
0   1                           Gears  1965  Technic        NaN
1   1  4.5V Samsonite Gears Motor Set  1965  Technic        NaN
2   1  TECHNIC I: Simple Machines Set  1985  Technic        NaN
3   1              ERBIE the Robo-Car  1985  Technic        NaN
4   1            Manual Control Set 1  1986  Technic        NaN

In [20]:
clean_join_2020 = join_2020[['id', 'name_x', 'year','name_y']].copy()
clean_join_2020.rename(columns={"year" :"Set Year",'name_x':'Set Name','name_y':'Theme Name'},inplace=True)
clean_join_2020.head()

   id                        Set Name  Set Year Theme Name
0   1                           Gears      1965    Technic
1   1  4.5V Samsonite Gears Motor Set      1965    Technic
2   1  TECHNIC I: Simple Machines Set      1985    Technic
3   1              ERBIE the Robo-Car      1985    Technic
4   1            Manual Control Set 1      1986    Technic

In [21]:
sets_1950_csv = "sets_1950_2017.csv"
sets_1950_db =pd.read_csv(sets_1950_csv,encoding='latin-1')
sets_1950_db.head(3)

,Inventory ID,Part Number,Color ID,Color,Transparent Brick,Quantity,Spare Parts,Set Number,Part Name,Part Category,Set Name,Set Category,Set Subcategory,Set Year
0,1,48379c01,72,Dark Bluish Gray,f,1,f,7922-1,Sports Promo Figure Base with Feet,Minifig Accessories,McDonald's Sports Set Number 6 - Orange Vest S...,Gravity Games,Sports,2004
1,1,48395,7,Light Gray,f,1,f,7922-1,Sports Promo Snowboard from McDonald's Sports ...,Minifig Accessories,McDonald's Sports Set Number 6 - Orange Vest S...,Gravity Games,Sports,2004
2,1,mcsport6,25,Orange,f,1,f,7922-1,Sports Promo Figure Head Torso Assembly McDona...,Minifigs,McDonald's Sports Set Number 6 - Orange Vest S...,Gravity Games,Sports,2004

In [22]:
sets_clean_1950_db = sets_1950_db[['Inventory ID','Set Name', 'Set Year','Set Category']].copy()
sets_clean_1950_db.head()

,Inventory ID,Set Name,Set Year,Set Category
0,1,McDonald's Sports Set Number 6 - Orange Vest S...,2004,Gravity Games
1,1,McDonald's Sports Set Number 6 - Orange Vest S...,2004,Gravity Games
2,1,McDonald's Sports Set Number 6 - Orange Vest S...,2004,Gravity Games
3,1,McDonald's Sports Set Number 6 - Orange Vest S...,2004,Gravity Games
4,3,Emma's Splash Pool,2012,Friends

In [23]:
sets_1950_=sets_clean_1950_db.loc[sets_clean_1950_db["Set Year"]==1950]
sets_1950_.rename(columns={"Set Category" :"Theme Name"},inplace=True)
sets_1950_.head()

C:\Users\cesar\anaconda3\lib\site-packages\pandas\core\frame.py:4125: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().rename(

,Inventory ID,Set Name,Set Year,Theme Name
18594,537,Individual 1 x 2 x 3 Window (without glass),1950,Supplemental
18595,537,Individual 1 x 2 x 3 Window (without glass),1950,Supplemental
18596,537,Individual 1 x 2 x 3 Window (without glass),1950,Supplemental
18597,537,Individual 1 x 2 x 3 Window (without glass),1950,Supplemental
18598,537,Individual 1 x 2 x 3 Window (without glass),1950,Supplemental

In [24]:
clean_join_2020.loc[clean_join_2020["Set Year"]==1950]

       id                                     Set Name  Set Year    Theme Name
1530  371                     Single 2 x 4 Brick (ABB)      1950  Supplemental
1531  371                     Single 2 x 2 Brick (ABB)      1950  Supplemental
1540  371  Single 1 x 4 x 2 Window without Glass (ABB)      1950  Supplemental
1541  371  Single 1 x 2 x 3 Window without Glass (ABB)      1950  Supplemental
1542  371  Single 1 x 2 x 2 Window without Glass (ABB)      1950  Supplemental
1543  371    Single 1 x 2 x 4 Door without Glass (ABB)      1950  Supplemental

In [35]:
lego = clean_join_2020.append([sets_1950_])
lego.head()

    id                        Set Name  Set Year Theme Name  Inventory ID
0  1.0                           Gears      1965    Technic           NaN
1  1.0  4.5V Samsonite Gears Motor Set      1965    Technic           NaN
2  1.0  TECHNIC I: Simple Machines Set      1985    Technic           NaN
3  1.0              ERBIE the Robo-Car      1985    Technic           NaN
4  1.0            Manual Control Set 1      1986    Technic           NaN

In [36]:
clean_lego = lego[['id','Set Name', 'Set Year','Theme Name']].copy()
clean_lego.head()

    id                        Set Name  Set Year Theme Name
0  1.0                           Gears      1965    Technic
1  1.0  4.5V Samsonite Gears Motor Set      1965    Technic
2  1.0  TECHNIC I: Simple Machines Set      1985    Technic
3  1.0              ERBIE the Robo-Car      1985    Technic
4  1.0            Manual Control Set 1      1986    Technic

In [37]:
lego_1950=clean_lego.loc[clean_lego["Set Year"]==1950]
lego_1950.head()

,id,Set Name,Set Year,Theme Name
1530,371.0,Single 2 x 4 Brick (ABB),1950,Supplemental
1531,371.0,Single 2 x 2 Brick (ABB),1950,Supplemental
1540,371.0,Single 1 x 4 x 2 Window without Glass (ABB),1950,Supplemental
1541,371.0,Single 1 x 2 x 3 Window without Glass (ABB),1950,Supplemental
1542,371.0,Single 1 x 2 x 2 Window without Glass (ABB),1950,Supplemental

In [38]:
lego_2020=clean_lego.loc[clean_lego["Set Year"]==2020]
lego_2020.head()

     id           Set Name  Set Year Theme Name
70  1.0              Buggy      2020    Technic
71  1.0  Mini CLAAS XERION      2020    Technic
72  1.0           Dragster      2020    Technic
73  1.0         Race Truck      2020    Technic
74  1.0          Catamaran      2020    Technic

In [39]:
result_c = lego_2020.append([lego_1950])
result_c.head()

     id           Set Name  Set Year Theme Name
70  1.0              Buggy      2020    Technic
71  1.0  Mini CLAAS XERION      2020    Technic
72  1.0           Dragster      2020    Technic
73  1.0         Race Truck      2020    Technic
74  1.0          Catamaran      2020    Technic

In [31]:
rds_connection_string = "postgres:1055@localhost:5432/Lego"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [32]:
engine.table_names()

['sets__2020_csv', 'thems_2020_csv', 'sets_1950_csv', 'Lego_clean', 'result_c']

In [33]:
result_c.to_sql(name='result_c', con=engine, if_exists='append', index=False)

In [34]:
pd.read_sql_query('select * from result_c', con=engine).head()

    id           Set Name  Set Year Theme Name
0  1.0              Buggy      2020    Technic
1  1.0  Mini CLAAS XERION      2020    Technic
2  1.0           Dragster      2020    Technic
3  1.0         Race Truck      2020    Technic
4  1.0          Catamaran      2020    Technic